app/controllers/comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("content", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "sddd"], ["book_id", 1], ["created_at", "2018-03-03 12:13:21.683867"], ["updated_at", "2018-03-03 12:13:21.683867"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 1], ["updated_at", "2018-03-03 12:13:21.690573"], ["id", 1]]
---
  def create
  @book = Book.find(params[:book_id])
  @comment = @book.comments.create (comment_params)
@comment.user_id = current_user.id

    respond_to do |format|
      if @comment.save